000100160316             CMD        'DISPLAY SYSTEM LEVEL'
000101160316             PARM       KWD(OUTPUT) MIN(1) TYPE(*CHAR) LEN(8) RSTD(*YES) VALUES(*MSGLINE +
000102160316                          *DISPLAY *PRINTER) PROMPT('OUTPUT FOR SYSTEM LEVEL:')  +
000107160316
000108160316             PARM       KWD(SOLUTION) TYPE(*CHAR) LEN(4) RSTD(*YES) VALUES(*YES *NO) DFT(*NO) +
000109160316                          PROMPT('HOW YOU DID IT:')  +
000114160316
000115160316             PARM       KWD(SHOWCMD) TYPE(*CHAR) LEN(4) RSTD(*YES) VALUES(*YES *NO) DFT(*NO) +
000116160316                          PROMPT('SHOW COMMAND:')
