000100160210             PGM
000101160210             DCLF       LAB4DF
000102160210             DCL        &QCURSYM *CHAR 1
000103160210             SNDRCVF
000104160210
000105160210             DOWHILE    (&IN03 = '0')
000106160210                SELECT
000107160210                   WHEN       (&INPUT='1' *OR &INPUT='01')CALLSUBR OPTION1
000110160210                ENDSELECT
000111160210                SNDRCVF
000112160210             ENDDO
000113160210
000114160210             SUBR       OPTION1
000115160210                RTVSYSVAL  SYSVAL(QCURSYM) RTNVAR(&QCURSYM)
000116160210                CHGVAR     &MESSAGE('G IS THE BEST' *CAT &QCURSYM)
000117160210             ENDSUBR
000118160210             ENDPGM
000119160210
000120160210
000121160210
000122160210
