000100160210             PGM
000101160210             CALL       STRJOB
000102160210             ADDLIBLE   IBC233LIB
000103160210             MONMSG     CPF2103
000104160210             DSPSYSLVL  *DISPLAY
000105160210             ENDPGM
000106160210
000107160210
000108160210
000109160210
