000100160129     FMARKSDSP  CF   E             WORKSTN
000101160129      /FREE
000102160129           EXFMT RECORD1;
000103160129           DOW NOT(*IN03);
000104160129             EXSR GETGRADE;
000105160129             WRITE RECORD1;
000106160129             EXFMT RECORD2;
000107160129             IF *IN03 = *OFF;
000108160129               EXSR CLEARMARKS;
000109160129               EXFMT RECORD1;
000110160129             ENDIF;
000111160129           ENDDO;
000112160129           *INLR = *ON;
000113160129           RETURN;
000114160129           BEGSR GETGRADE;
000115160202
000116160202            TESTOVERAL =(TEST1 + TEST2 + TEST3)/3;
000117160203
000118160203            TESTOVERAL = TESTOVERAL * .35;
000119160203
000120160203
000121160203            EXAM = EXAM * .35;
000122160202            TESTOVERAL=(TESTOVERAL+LABS+EXAM);
000123160202            SELECT;
000124160203              WHEN TESTOVERAL >=90;
000125160202                     LETGRADE = 'A+';
000126160202                     NUMGRADE = TESTOVERAL;
000127160203              WHEN TESTOVERAL >=80;
000128160202                     LETGRADE = 'A';
000129160202                     NUMGRADE = TESTOVERAL;
000130160203              WHEN TESTOVERAL >=75;
000131160202                     LETGRADE = 'B+';
000132160202                     NUMGRADE = TESTOVERAL;
000133160203              WHEN TESTOVERAL >=70;
000134160202                     LETGRADE = 'B';
000135160202                     NUMGRADE = TESTOVERAL;
000136160203              WHEN TESTOVERAL >=65;
000137160202                     LETGRADE = 'C+';
000138160202                     NUMGRADE = TESTOVERAL;
000139160203              WHEN TESTOVERAL >=60;
000140160202                     LETGRADE= 'C';
000141160202                     NUMGRADE =TESTOVERAL;
000142160203              WHEN TESTOVERAL >=55;
000143160202                     LETGRADE = 'D+';
000144160202                     NUMGRADE = TESTOVERAL;
000145160203              WHEN TESTOVERAL >=50;
000146160202                     LETGRADE = 'D';
000147160202                     NUMGRADE = TESTOVERAL;
000148160203              WHEN TESTOVERAL <=49;
000149160202                     LETGRADE = 'F';
000150160202                     NUMGRADE = TESTOVERAL;
000151160202
000152160202
000153160202            ENDSL;
000154160203            WRITE RECORD1;
000155160129           ENDSR;
000156160129           BEGSR CLEARMARKS;
000157160129             TEST1=0;
000158160202             TEST2=0;
000159160202             TEST3=0;
000160160202             EXAM=0;
000161160202             LABS=0;
000162160203
000163160129           ENDSR;
