000100160310     FMARKSDSP2 CF   E             WORKSTN
000101160310
000102160310      /FREE
000103160310            *IN40 = *OFF;
000104160310            EXFMT RECORD1;
000105160311            PASS = 0;
000106160311            FAIL = 0;
000107160311            QUERIES = 0;
000108160311            AVERAGE = 0;
000109160310                  DOW NOT(*IN03);
000110160310                       EXSR GETGRADE;
000111160310                       WRITE RECORD1;
000112160310                       *IN21 = *OFF;
000113160310                       *IN22 = *OFF;
000114160310                       *IN23 = *OFF;
000115160310                       *IN40 = *OFF;
000116160310                       *IN41 = *OFF;
000117160310                       EXFMT RECORD2;
000118160310                       *IN60 = *OFF;
000119160311                       AVERAGE = AVERAGE * QUERIES;
000120160311                       QUERIES = QUERIES + 1;
000121160311                       AVERAGE = (AVERAGE + NUMGRADE)/QUERIES;
000122160310                       IF *IN03 = *OFF;
000123160310                               EXSR CLEARMARKS;
000124160310                               EXFMT RECORD1;
000125160310                       ENDIF;
000126160310                       IF *IN03 = *ON;
000127160310                           EXSR CLEARMARKS;
000128160311                           EXFMT RECORD3;
000129160310                           RETURN;
000130160310                       ENDIF;
000131160310                  ENDDO;
000132160310            *INLR = *ON;
000133160310            RETURN;
000134160310       BEGSR GETGRADE;
000135160310       *IN40 = *ON;
000136160310          NUMGRADE = (LABS/30)*30 + ((TEST1+TEST2+TEST3)/300)*35 +  EXAM/100*35;
000137160310          TESTOVRALL = (TEST1 + TEST2 + TEST3)/3;
000138160310          IF TEST1 < TEST2 AND TEST1 < TEST3;
000139160310            *IN21 = *ON;
000140160310             TESTOVRALL = (TEST2 + TEST3)/2;
000141160310          ENDIF;
000142160310          IF TEST2 < TEST1 AND TEST2 < TEST3 ;
000143160310            *IN22 = *ON;
000144160310             TESTOVRALL = (TEST1 + TEST3)/2;
000145160310          ENDIF;
000146160310          IF TEST3 < TEST1 AND TEST3 < TEST2 ;
000147160310            *IN23 = *ON;
000148160310             TESTOVRALL = (TEST1 + TEST2)/2;
000149160310          ENDIF;
000150160310          IF TEST1 = TEST2 AND *IN23 = *OFF;
000151160310             *IN21 = *ON;
000152160310             TESTOVRALL = (TEST2 + TEST3)/2;
000153160310          ENDIF;
000154160310          IF TEST1 = TEST3 AND *IN22 = *OFF;
000155160310             *IN21 = *ON;
000156160310             TESTOVRALL = (TEST2 + TEST3)/2;
000157160310          ENDIF;
000158160310          IF TEST3 = TEST2 AND *IN21 = *OFF;
000159160310             *IN22 = *ON;
000160160310            TESTOVRALL = (TEST1 + TEST3)/2;
000161160310          ENDIF;
000162160310
000163160310          SELECT;
000164160310          When NUMGRADE >= 90;
000165160310                LETGRADE = 'A+';
000166160310          When NUMGRADE >= 80;
000167160310                LETGRADE = 'A';
000168160310          When NUMGRADE >= 75;
000169160310                LETGRADE = 'B+';
000170160310          When NUMGRADE >= 70;
000171160310                LETGRADE = 'B';
000172160310          When NUMGRADE >= 65;
000173160310                LETGRADE = 'C+';
000174160310          When NUMGRADE >= 60;
000175160310                LETGRADE = 'C';
000176160310          When NUMGRADE >= 55;
000177160310                LETGRADE = 'D+';
000178160310          WHEN NUMGRADE >=50;
000179160310                LETGRADE = 'D';
000180160310          When NUMGRADE < 49;
000181160310                LETGRADE = 'F';
000182160310          ENDSL;
000183160310          IF EXAM < 50 AND TESTOVRALL > 50;
000184160310             *IN41 = *ON;
000185160310             LETGRADE = 'F';
000186160311             FAIL = FAIL + 1;
000187160310          ENDIF;
000188160310           IF TESTOVRALL < 50;
000189160310            *IN60 = *ON;
000190160310            LETGRADE = 'F';
000191160311            FAIL = FAIL + 1;
000192160310          ENDIF;
000193160311          IF TESTOVRALL >= 55 AND EXAM >= 55;
000194160311            PASS = PASS + 1;
000195160311          ENDIF;
000196160310       ENDSR;
000197160310
000198160310       BEGSR CLEARMARKS;
000199160310          TEST1 = 0;
000200160310          TEST2 = 0;
000201160310          TEST3 = 0;
000202160310          LABS = 0;
000203160310          EXAM = 0;
000204160310       ENDSR;
