000100160308     A          R STUDENTSR                 PFILE(STUDENTS2)
000101160308     A          K LASTNAME
000102160308     A          S FINESOWED                 COMP(GT 0)
