000001160129     A          R RECORD1                   CA03(03 'EXIT')
000002160129     A                                  2 71DATE
000003160129     A                                  3 70TIME
000004160129     A                                  2 26'MARKS CALCULATOR'
000005160129     A                                  4 27'TEST 1:'
000006160129     A                                  5 27'TEST 2:'
000007160129     A                                  6 27'TEST 3:'
000008160129     A                                  7 27'LABS:'
000009160129     A                                  8 27'EXAM:'
000010160309     A            TEST1          3  0B  4 36RANGE(0 100)
000012160309     A            TEST2          3  0B  5 36RANGE(0 100)
000014160309     A            LABS           3  0B  7 36RANGE(0 30)
000016160309     A            TEST3          3  0B  6 36RANGE(0 100)
000017160309     A                                      DSPATR(PR)
000018160309     A            EXAM           3  0B  8 36RANGE(0 100)
000020160203     A                                  2  4'DW233A20'
000021160203     A                                  3  4'SENECA'
000025160129     A          R RECORD2                   OVERLAY
000026160202     A                                      CA03(03 'EXIT')
000027160309     A                                 13 27'TESTS:'
000028160129     A                                 14 27'FINAL MARK:'
000029160129     A                                 15 27'FINAL GRADE:'
000030160129     A                                 16 27'F3 - EXIT'
000031160129     A            TESTOVERAL     3D 0O 13 39
000032160129     A            NUMGRADE       3D 0O 14 39
000033160129     A            LETGRADE       2   O 15 40
000100      
