000100160306     A          R MARKS2R
000101160306     A            STUDENTID      9P 0       COLHDG('STUDENT' 'ID')
000102160306     A            COURSE_CD      6          COLHDG('COURSE' 'CODE')
000103160306     A            FINAL_MARK     3S         COLHDG('FINAL' 'MARK')
000104160306     A            DATERUN         L         COLHDG('DATE' 'RUN')
