000001160317     FSTUDENTDSPCF   E             WORKSTN
000002160317     FSTUDENTS2 IF   E             DISK
000003160317      /FREE
000004160317            READ STUDENTS2;
000005160317            *IN40 = *ON;
000006160317            DOW NOT(*IN03) AND %EOF='0';
000007160317              *IN40 = *OFF;
000008160317              *IN41 = *OFF;
000009160317               IF FINESOWED > 0.0;
000010160318                 *IN41 = *ON;
000011160317               ENDIF;
000012160317               IF FEESOWED > 0.0;
000013160318                 *IN40 = *ON;
000014160317               ENDIF;
000015160317              EXFMT RECORD1;
000016160317              TOTSTUD = TOTSTUD + 1;
000017160317              FINESTOTAL = FINESTOTAL + FINESOWED;
000018160317              FEESTOTAL = FEESTOTAL + FEESOWED;
000019160317              READ STUDENTS2;
000020160317            ENDDO;
000021160317            TOTAL = FEESTOTAL + FINESTOTAL;
000022160317            EXFMT RECORD2;
000023160317            *INLR = *ON;
000024160317            RETURN;
000025160317      /END-FREE
000026160317
